# [作業目標]

1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```


2. 一個包含兩個欄位的 DataFrame，將每個數字減去

```
* 1) 該欄位的平均數
* 2) 該筆資料平均數
```

3. 承上題，請問：

```
* 1) 哪一比的資料總合最小
* 2) 哪一欄位的資料總合最小
```

# 作業

### 1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```

In [8]:
# 記得先 Import 正確的套件
import numpy as np
import pandas as pd
'''
Your Code
'''

'\nYour Code\n'

In [34]:
data = {
    'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
    'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
    'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']
}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

#### 1-1

In [24]:
print("cat:",df[df['animal']=='cat'].age.mean())
print("dog:",df[df['animal']=='dog'].age.mean())
print("snake:",df[df['animal']=='snake'].age.mean())

print('\n',df.groupby('animal').age.mean())

cat: 2.5
dog: 5.0
snake: 2.5

 animal
cat      2.5
dog      5.0
snake    2.5
Name: age, dtype: float64

#### 1-2

In [35]:
df.sort_values(['age','visits'],ascending=False)

  animal  age  visits priority
i    dog  7.0       2       no
e    dog  5.0       2       no
g  snake  4.5       1       no
b    cat  3.0       3      yes
j    dog  3.0       1       no
a    cat  2.5       1      yes
f    cat  2.0       3       no
c  snake  0.5       2       no
d    dog  NaN       3      yes
h    cat  NaN       1      yes

#### 1-3

In [36]:
df['priority'] = df['priority'].replace('yes','True')
df['priority'] = df['priority'].replace('no','False')
df

  animal  age  visits priority
a    cat  2.5       1     True
b    cat  3.0       3     True
c  snake  0.5       2    False
d    dog  NaN       3     True
e    dog  5.0       2    False
f    cat  2.0       3    False
g  snake  4.5       1    False
h    cat  NaN       1     True
i    dog  7.0       2    False
j    dog  3.0       1    False

### 2. 一個包含兩個欄位的 DataFrame，將每個數字減去

* 1) 該欄位的平均數
* 2) 該筆資料平均數

In [45]:
df = pd.DataFrame(np.random.random(size=(5, 3)))
df

          0         1         2
0  0.331251  0.208221  0.619583
1  0.620800  0.780144  0.978170
2  0.100978  0.167324  0.632984
3  0.434787  0.357400  0.986449
4  0.201981  0.833389  0.663083

#### 2-1

In [ ]:
# 確認df
print(df,'\n')
# 找出平均數，預設為axis=0
print(df.mean(),'\n')
# 直接算
print(df-df.mean())

          0         1         2
0  0.331251  0.208221  0.619583
1  0.620800  0.780144  0.978170
2  0.100978  0.167324  0.632984
3  0.434787  0.357400  0.986449
4  0.201981  0.833389  0.663083

0    0.337959
1    0.469296
2    0.776054
dtype: float64

          0         1         2
0 -0.006708 -0.261074 -0.156471
1  0.282840  0.310848  0.202116
2 -0.236981 -0.301972 -0.143070
3  0.096828 -0.111896  0.210396
4 -0.135979  0.364093 -0.112971

### 2-2

In [63]:
# 可以用兩個公式
# 第一種
print(df.values.mean())

# 第二種
print(df.to_numpy().mean())

0.5277695181062901
0.5277695181062901

### 3. 承上題，請問：

1) 哪一比的資料總合最小
2) 哪一欄位的資料總合最小

In [64]:
df

          0         1         2
0  0.331251  0.208221  0.619583
1  0.620800  0.780144  0.978170
2  0.100978  0.167324  0.632984
3  0.434787  0.357400  0.986449
4  0.201981  0.833389  0.663083

#### 3-1

In [65]:
print(df.sum(axis=1))

0    1.159055
1    2.379113
2    0.901285
3    1.778636
4    1.698453
dtype: float64

#### 3-2

In [66]:
print(df.sum(axis=0))

0    1.689796
1    2.346478
2    3.880268
dtype: float64